In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Data Historis Jakarta Islamic.csv')
df.head()

      Tanggal Terakhir Pembukaan Tertinggi Terendah   Vol. Perubahan%
0  08/04/2025   372,00    375,18    375,18   367,17  1,51B     -9,61%
1  27/03/2025   411,54    407,59    411,54   404,55  1,08B      0,68%
2  26/03/2025   408,77    399,44    411,19   399,44  1,49B      3,10%
3  25/03/2025   396,47    396,48    398,60   392,77  1,48B      0,51%
4  24/03/2025   394,46    406,24    406,62   381,72  1,68B     -2,96%

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2420 entries, 0 to 2419
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tanggal     2420 non-null   object
 1   Terakhir    2420 non-null   object
 2   Pembukaan   2420 non-null   object
 3   Tertinggi   2420 non-null   object
 4   Terendah    2420 non-null   object
 5   Vol.        2416 non-null   object
 6   Perubahan%  2420 non-null   object
dtypes: object(7)
memory usage: 132.5+ KB

In [4]:
df.describe()

           Tanggal Terakhir Pembukaan Tertinggi Terendah   Vol. Perubahan%
count         2420     2420      2420      2420     2420   2416       2420
unique        2420     2308      2313      2306     2334   1543        534
top     08/04/2025   731,14    577,42    698,08   570,10  1,11B     -0,31%
freq             1        3         4         3        3     29         17

In [6]:
df['Tanggal'] = pd.to_datetime(df['Tanggal'], format='%d/%m/%Y')

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2420 entries, 0 to 2419
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Tanggal                2420 non-null   datetime64[ns]
 1   Terakhir               2420 non-null   float64
 2   Pembukaan              2420 non-null   float64
 3   Tertinggi              2420 non-null   float64
 4   Terendah               2420 non-null   float64
 5   Vol.                   2416 non-null   float64
 6   Perubahan%             2420 non-null   float64
 7   PriceTy                2420 non-null   float64
 8   PriceVol               2416 non-null   float64
 9   Cumulative             2416 non-null   float64
 10  CumulativePriceVolume  2416 non-null   float64
 11  VWAP                   2416 non-null   float64
dtypes: datetime64[ns](1), float64(11)
memory usage: 227.0 KB

In [15]:
def convert_volume(vol_str):
    if isinstance(vol_str, str):
        vol_str = vol_str.replace(',', '.')
        multiplier = 1
        if vol_str.endswith('B'):
            multiplier = 1_000_000_000
            vol_str = vol_str.replace('B', '')
        elif vol_str.endswith('M'):
            multiplier = 1_000_000
            vol_str = vol_str.replace('M', '')
        elif vol_str.endswith('K'):
            multiplier = 1_000
            vol_str = vol_str.replace('K', '')
        return float(vol_str) * multiplier
    return vol_str

df['Vol.'] = df['Vol.'].apply(convert_volume)

In [33]:
df.head()

,Tanggal,Terakhir,Pembukaan,Tertinggi,Terendah,Vol.,Perubahan%,PriceTy,PriceVol,Cumulative,CumulativePriceVolume,VWAP
0,2025-04-08,372.00,375.18,375.18,367.17,1.510000e+09,-9.61,371.450000,5.608895e+11,1.510000e+09,5.608895e+11,371.450000
1,2025-03-27,411.54,407.59,411.54,404.55,1.080000e+09,0.68,409.210000,4.419468e+11,2.590000e+09,1.002836e+12,387.195483
2,2025-03-26,408.77,399.44,411.19,399.44,1.490000e+09,3.10,406.466667,6.056353e+11,4.080000e+09,1.608472e+12,394.233243
3,2025-03-25,396.47,396.48,398.60,392.77,1.480000e+09,0.51,395.946667,5.860011e+11,5.560000e+09,2.194473e+12,394.689335
4,2025-03-24,394.46,406.24,406.62,381.72,1.680000e+09,-2.96,394.266667,6.623680e+11,7.240000e+09,2.856841e+12,394.591257

In [24]:
df['Terakhir'] = df['Terakhir'].astype(str).str.replace(',', '.').astype(float)
df['Pembukaan'] = df['Pembukaan'].astype(str).str.replace(',', '.').astype(float)
df['Tertinggi'] = df['Tertinggi'].astype(str).str.replace(',', '.').astype(float)
# df['Perubahan%'] = df['Perubahan%'].astype(str).str.replace(',', '.').astype(float)

In [27]:
df['Terendah'] = df['Terendah'].astype(str).str.replace(',', '.').astype(float)

In [29]:
df['Perubahan%'] = df['Perubahan%'].astype(str).str.replace('%', '').str.replace(',', '.').astype(float)

In [32]:
df['PriceTy'] = (df['Tertinggi'] + df['Terendah'] + df['Terakhir']) / 3
df['PriceVol'] = df['PriceTy'] * df['Vol.']
df['Cumulative'] = df['Vol.'].cumsum()
df['CumulativePriceVolume'] = df['PriceVol'].cumsum()
df['VWAP'] = df['CumulativePriceVolume'] / df['Cumulative']

In [35]:
df.isnull().sum()

Tanggal                  0
Terakhir                 0
Pembukaan                0
Tertinggi                0
Terendah                 0
Vol.                     4
Perubahan%               0
PriceTy                  0
PriceVol                 4
Cumulative               4
CumulativePriceVolume    4
VWAP                     4
dtype: int64

In [36]:
df.duplicated().sum()

0

In [38]:
DataFrame = df[['Tanggal', 'Terakhir', 'Pembukaan', 'Tertinggi', 'Terendah', 'Vol.', 'Perubahan%', 'VWAP']]

In [40]:
DataFrame.head(10)

,Tanggal,Terakhir,Pembukaan,Tertinggi,Terendah,Vol.,Perubahan%,VWAP
0,2025-04-08,372.00,375.18,375.18,367.17,1.510000e+09,-9.61,371.450000
1,2025-03-27,411.54,407.59,411.54,404.55,1.080000e+09,0.68,387.195483
2,2025-03-26,408.77,399.44,411.19,399.44,1.490000e+09,3.10,394.233243
3,2025-03-25,396.47,396.48,398.60,392.77,1.480000e+09,0.51,394.689335
4,2025-03-24,394.46,406.24,406.62,381.72,1.680000e+09,-2.96,394.591257
5,2025-03-21,406.49,413.90,414.29,403.12,2.570000e+09,-1.55,398.095314
6,2025-03-20,412.89,407.78,414.14,407.30,1.490000e+09,1.98,399.855363
7,2025-03-19,404.89,402.92,407.69,396.07,1.300000e+09,0.98,400.167772
8,2025-03-18,400.94,419.17,419.77,384.86,2.280000e+09,-3.95,400.426555
9,2025-03-17,417.44,415.43,420.81,415.22,1.320000e+09,1.05,401.844070